Revit 2026 API

# ModelPathRegion Property

---

The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Region { get; }
```
```vb
Public ReadOnly Property Region As String
	Get
```
```cpp
public:
property String^ Region {
	String^ get ();
}
```
```fsharp
member Region : string with get
```

#### Property Value

String

#### Reference

ModelPath Class

Autodesk.Revit.DB Namespace